In [1]:
import numpy as np
import pandas as pd

In [4]:
data = {'A':[80,90,100],'B':[92, np.nan, np.nan],'C':[99,69,np.nan]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

     A     B     C
0   80  92.0  99.0
1   90   NaN  69.0
2  100   NaN   NaN

In [7]:
df.dropna()

    A     B     C
0  80  92.0  99.0

In [8]:
df.dropna(axis=1)

     A
0   80
1   90
2  100

In [10]:
df.dropna(thresh=2) #drops ones with more than 2

    A     B     C
0  80  92.0  99.0
1  90   NaN  69.0

In [11]:
df.fillna(value=0)

     A     B     C
0   80  92.0  99.0
1   90   0.0  69.0
2  100   0.0   0.0

In [15]:
#lemme fill the missing with its mean
df['C'].fillna(value=df['C'].mean())

0    99.0
1    69.0
2    84.0
Name: C, dtype: float64